In [5]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

In [25]:
df = pd.DataFrame({
    "Age":['5','40','35'],
    "Name":['Bhuvana','Nagesh','Lavanya'],
    "Company":[np.nan,'Oracle','SalesForce'],
    "Class":['Second',np.nan, np.nan],
    "Student_id":['123',np.nan, np.nan]
}
)

In [27]:
df

  Age     Name     Company   Class
0   5  Bhuvana         NaN  Second
1  40   Nagesh      Oracle     NaN
2  35  Lavanya  SalesForce     NaN